# TransferredProjectStandardsEventArgs Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TransferredProjectStandardsEventArgs Class
Members See Also
---
The event arguments used by the TransferredProjectStandards event.
**Namespace:** Autodesk.Revit.UI.Events**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017.2
# Syntax
C#
---
```text
public class TransferredProjectStandardsEventArgs : RevitAPISingleEventArgs
```

Visual Basic
---
```text
Public Class TransferredProjectStandardsEventArgs _
	Inherits RevitAPISingleEventArgs
```

Visual C++
---
```text
public ref class TransferredProjectStandardsEventArgs : public RevitAPISingleEventArgs
```

# Inheritance Hierarchy
System..::..Object System..::..EventArgs Autodesk.Revit.DB.Events..::..RevitAPIEventArgs Autodesk.Revit.DB.Events..::..RevitAPISingleEventArgs Autodesk.Revit.UI.Events..::..TransferredProjectStandardsEventArgs
# See Also
TransferredProjectStandardsEventArgs Members
Autodesk.Revit.UI.Events Namespace